In [2]:
%load_ext sql
%sql mysql+mysqlconnector://root:root@localhost/
%sql show databases;

The sql extension is already loaded. To reload it, use:
  %reload_ext sql
 * mysql+mysqlconnector://root:***@localhost/
12 rows affected.

[('blog',),
 ('information_schema',),
 ('mysql',),
 ('performance_schema',),
 ('pract-1',),
 ('sakila',),
 ('sales',),
 ('smartdb',),
 ('sys',),
 ('talktodb',),
 ('test',),
 ('world',)]

In [16]:
%%sql
use talktodb;
show tables;

 * mysql+mysqlconnector://root:***@localhost/
0 rows affected.
2 rows affected.

[('transactions',), ('users',)]

In [17]:
%%sql
select * from users;

 * mysql+mysqlconnector://root:***@localhost/
2 rows affected.

[(2, 'Bob', 'bob@example.com', datetime.datetime(2025, 12, 24, 22, 50, 17)),
 (3, 'Carol', 'carol@example.com', datetime.datetime(2025, 12, 24, 22, 50, 17))]

In [18]:
%%sql
drop table transactions;
drop table users;

 * mysql+mysqlconnector://root:***@localhost/
0 rows affected.
0 rows affected.

[]

In [14]:
%%sql
CREATE DATABASE IF NOT EXISTS talktodb;
USE talktodb;

CREATE TABLE IF NOT EXISTS users (
  id INT AUTO_INCREMENT PRIMARY KEY,
  name VARCHAR(100),
  email VARCHAR(150),
  created_at DATETIME DEFAULT CURRENT_TIMESTAMP
);

CREATE TABLE IF NOT EXISTS transactions (
  id INT AUTO_INCREMENT PRIMARY KEY,
  user_id INT,
  amount DECIMAL(10,2),
  txn_date DATE,
  status VARCHAR(50),
  CONSTRAINT fk_transactions_user
    FOREIGN KEY (user_id)
    REFERENCES users(id)
    ON DELETE CASCADE
    ON UPDATE CASCADE
);

INSERT INTO users (name, email) VALUES
('Alice', 'alice@example.com'),
('Bob', 'bob@example.com'),
('Carol', 'carol@example.com');

INSERT INTO transactions (user_id, amount, txn_date, status) VALUES
(1, 120.50, '2024-01-05', 'completed'),
(1, 45.00, '2024-02-01', 'completed'),
(2, 560.00, '2024-02-12', 'failed'),
(3, 30.00, '2024-03-15', 'completed'),
(2, 250.00, '2024-03-20', 'completed');

 * mysql+mysqlconnector://root:***@localhost/
1 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
3 rows affected.
5 rows affected.

[]

In [ ]:
%%sql
INSERT INTO users (name, email) VALUES
('Alice', 'alice@example.com'),
('Bob', 'bob@example.com'),
('Carol', 'carol@example.com');

INSERT INTO transactions (user_id, amount, txn_date, status) VALUES
(1, 120.50, '2024-01-05', 'completed'),
(1, 45.00, '2024-02-01', 'completed'),
(2, 560.00, '2024-02-12', 'failed'),
(3, 30.00, '2024-03-15', 'completed'),
(2, 250.00, '2024-03-20', 'completed');

In [15]:
%%sql 
select * from transactions;

 * mysql+mysqlconnector://root:***@localhost/
5 rows affected.

[(1, 1, Decimal('120.50'), datetime.date(2024, 1, 5), 'completed'),
 (2, 1, Decimal('45.00'), datetime.date(2024, 2, 1), 'completed'),
 (3, 2, Decimal('560.00'), datetime.date(2024, 2, 12), 'failed'),
 (4, 3, Decimal('30.00'), datetime.date(2024, 3, 15), 'completed'),
 (5, 2, Decimal('250.00'), datetime.date(2024, 3, 20), 'completed')]